experiments/workflow/beldi-hotel/expected_results/qps200/wrk_warmup.log
Running 30s test @ http://ip-172-31-12-27.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 6.013ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 0.900ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.23ms    8.38ms  47.20ms   91.50%
    Req/Sec   103.24     33.34   555.00     90.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.87ms
 75.000%    1.12ms
 90.000%    3.83ms
 99.000%   43.20ms
 99.900%   43.46ms
 99.990%   47.23ms
 99.999%   47.23ms
100.000%   47.23ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.255     0.000000            1         1.00
       0.394     0.100000          400         1.11
       0.519     0.200000          801         1.25
       0.647     0.300000         1201         1.43
       0.742     0.400000         1600         1.67
       0.872     0.500000         2002         2.00
       0.939     0.550000         2200         2.22
       0.990     0.600000         2399         2.50
       1.036     0.650000         2602         2.86
       1.071     0.700000         2801         3.33
       1.116     0.750000         2999         4.00
       1.155     0.775000         3101         4.44
       1.184     0.800000         3199         5.00
       1.217     0.825000         3299         5.71
       1.249     0.850000         3399         6.67
       1.288     0.875000         3500         8.00
       1.323     0.887500         3549         8.89
       3.831     0.900000         3601        10.00
       3.901     0.912500         3649        11.43
      13.695     0.925000         3709        13.33
      23.519     0.937500         3757        16.00
      23.535     0.943750         3780        17.78
      23.551     0.950000         3805        20.00
      23.791     0.956250         3824        22.86
      33.375     0.962500         3859        26.67
      33.407     0.968750         3898        32.00
      33.407     0.971875         3898        35.56
      33.439     0.975000         3905        40.00
      33.759     0.978125         3911        45.71
      43.199     0.981250         3985        53.33
      43.199     0.984375         3985        64.00
      43.199     0.985938         3985        71.11
      43.199     0.987500         3985        80.00
      43.199     0.989062         3985        91.43
      43.199     0.990625         3985       106.67
      43.199     0.992188         3985       128.00
      43.199     0.992969         3985       142.22
      43.199     0.993750         3985       160.00
      43.199     0.994531         3985       182.86
      43.199     0.995313         3985       213.33
      43.199     0.996094         3985       256.00
      43.199     0.996484         3985       284.44
      43.231     0.996875         3990       320.00
      43.231     0.997266         3990       365.71
      43.231     0.997656         3990       426.67
      43.295     0.998047         3993       512.00
      43.295     0.998242         3993       568.89
      43.295     0.998437         3993       640.00
      43.295     0.998633         3993       731.43
      43.455     0.998828         3994       853.33
      43.519     0.999023         3996      1024.00
      43.519     0.999121         3996      1137.78
      43.519     0.999219         3996      1280.00
      43.519     0.999316         3996      1462.86
      43.519     0.999414         3996      1706.67
      47.199     0.999512         3997      2048.00
      47.199     0.999561         3997      2275.56
      47.199     0.999609         3997      2560.00
      47.199     0.999658         3997      2925.71
      47.199     0.999707         3997      3413.33
      47.231     0.999756         3998      4096.00
      47.231     1.000000         3998          inf
#[Mean    =        3.228, StdDeviation   =        8.381]
#[Max     =       47.200, Total count    =         3998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  202.00us
 75.000%  230.00us
 90.000%  252.00us
 99.000%   42.91ms
 99.900%   43.01ms
 99.990%   46.91ms
 99.999%   46.91ms
100.000%   46.91ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.132     0.000000            2         1.00
       0.163     0.100000          422         1.11
       0.174     0.200000          815         1.25
       0.183     0.300000         1228         1.43
       0.191     0.400000         1602         1.67
       0.202     0.500000         2033         2.00
       0.207     0.550000         2214         2.22
       0.213     0.600000         2414         2.50
       0.219     0.650000         2614         2.86
       0.224     0.700000         2811         3.33
       0.230     0.750000         3017         4.00
       0.233     0.775000         3110         4.44
       0.236     0.800000         3200         5.00
       0.240     0.825000         3320         5.71
       0.244     0.850000         3435         6.67
       0.247     0.875000         3501         8.00
       0.249     0.887500         3550         8.89
       0.252     0.900000         3608        10.00
       0.254     0.912500         3649        11.43
       0.258     0.925000         3700        13.33
       0.263     0.937500         3760        16.00
       0.266     0.943750         3780        17.78
       0.269     0.950000         3802        20.00
       0.274     0.956250         3828        22.86
       0.278     0.962500         3850        26.67
       0.283     0.968750         3877        32.00
       0.285     0.971875         3888        35.56
       0.293     0.975000         3899        40.00
       0.308     0.978125         3911        45.71
      42.847     0.981250         3924        53.33
      42.879     0.984375         3944        64.00
      42.879     0.985938         3944        71.11
      42.911     0.987500         3962        80.00
      42.911     0.989062         3962        91.43
      42.911     0.990625         3962       106.67
      42.943     0.992188         3974       128.00
      42.943     0.992969         3974       142.22
      42.943     0.993750         3974       160.00
      42.975     0.994531         3986       182.86
      42.975     0.995313         3986       213.33
      42.975     0.996094         3986       256.00
      42.975     0.996484         3986       284.44
      42.975     0.996875         3986       320.00
      43.007     0.997266         3994       365.71
      43.007     0.997656         3994       426.67
      43.007     0.998047         3994       512.00
      43.007     0.998242         3994       568.89
      43.007     0.998437         3994       640.00
      43.007     0.998633         3994       731.43
      43.007     0.998828         3994       853.33
      43.039     0.999023         3995      1024.00
      43.039     0.999121         3995      1137.78
      43.039     0.999219         3995      1280.00
      43.071     0.999316         3996      1462.86
      43.071     0.999414         3996      1706.67
      46.911     0.999512         3998      2048.00
      46.911     1.000000         3998          inf
#[Mean    =        1.113, StdDeviation   =        6.174]
#[Max     =       46.880, Total count    =         3998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 0.93MB read
Requests/sec:    200.06
Transfer/sec:     31.85KB